app/views/albums/index.html.erb

        <td><%= album.name %></td>
        <td><%= Artist.find(album.artist_id).name %></td>
---
SELECT  "artists".* FROM "artists"  WHERE "artists"."id" = ? LIMIT 1  [["id", 3]]