app/controllers/albums_controller.rb

INSERT INTO "albums" ("artist_id", "created_at", "name", "play", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?)  [["artist_id", 3], ["created_at", "2014-10-24 05:45:41.966811"], ["name", "Murmur"], ["play", 8], ["updated_at", "2014-10-24 05:45:41.966811"], ["year", 1983]]
---
  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save

UPDATE "albums" SET "play" = ?, "updated_at" = ?, "year" = ? WHERE "albums"."id" = 3  [["play", 22], ["updated_at", "2014-10-24 01:58:25.521197"], ["year", 2222]]
---
  def update
    respond_to do |format|
      if @album.update(album_params)

SELECT "albums".* FROM "albums"  WHERE (name like '%%')
---
def search
   @album = Album.where("name like ?", "%#{params[:q]}%")